//开始页面
char startMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃           1.用户登录             ┃",
	"┃           2.修改密码             ┃",
	"┃           3.注册用户             ┃",
	"┃           0.退出系统             ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};
//宿舍管理页面 
char dormtMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃           1.入住宿舍             ┃",
	"┃           2.查找信息             ┃",
	"┃           3.浏览信息             ┃",
	"┃           4.修改信息             ┃",
	"┃           5.退出宿舍             ┃",
	"┃           0.退出登录             ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};
//查找页面 
char findMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃     1.按宿舍性质查找床位数       ┃",
	"┃        2.楼层空宿舍查找          ┃",
	"┃        3.房间床位数查找          ┃",
	"┃         4.学生信息查找           ┃",
	"┃           0.退出查找             ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};
//浏览信息界面 
char lookMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃         1.学生信息浏览           ┃",
	"┃         2.宿舍信息浏览           ┃",
	"┃         0.退出信息浏览           ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};
//空界面供需要时使用 
char emptyMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};
//登录或注册页面
char logMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃   ┌───────────┐     ┃",
	"┃   │用户名:               │     ┃",
	"┃   │密  码:               │     ┃",
	"┃   └───────────┘     ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};
//修改密码页面 
char changeCodeMenu[][100] = {
	"┏━━━━━━━━━━━━━━━━━┓",
	"┃         学生宿舍管理系统         ┃",
	"┃━━━━━━━━━━━━━━━━━┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃   ┌───────────┐     ┃",
	"┃   │用户名:               │     ┃",
	"┃   │旧密码:               │     ┃",
	"┃   │新密码:               │     ┃",
	"┃   └───────────┘     ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┃                                  ┃",
	"┗━━━━━━━━━━━━━━━━━┛"
};

struct student{
	int building;
	int floorNum;
	int houseNum;
	int age;
	char name[12];
	char sex[3];
	char number[12];
	char major[25];
	char times[10];
	struct student *next;
};
struct dorm{
	int building;
	int floorNum;
	int houseNum;
	int haveNum;
	int emptyBed;
	char dormSex[3];
	struct dorm *next;
};
struct dorm *dormHead1;
struct student *studentHead;
int nn = 0;
int boyN = 0;

//将学生信息写入文件 
void writeStudentToFile();
//将学生宿舍信息写入文件 
void writeDormToFile();






